CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
/// lab 5 part 3 (extra credit)
#if 0

void spi_flash_read_page(void) {
  const uint32_t spi_clock_mhz = 12;
  ssp2__lab_init(spi_clock_mhz);
  ssp2__init_spi_pins();

  uint32_t data_address = 0x005C00;
  uint8_t input_data = 0xC1;
  int write_times = 10;

  while (1) {
    // delay__ms(10);
    const adesto_flash_id_s id = adesto_read_signature();

    // When we read a manufacturer ID we do not expect, we will kill this task
    if (id.manufacturer_id != 0x1F) {
      fprintf(stderr, "Manufacturer ID read failure\n");
      vTaskSuspend(NULL); // Kill this task
    } else {
      fprintf(stderr, "manufacturer_id: %p, device_id1: %p, device_id2: %p, external_device_id: %p\n",
              id.manufacturer_id, id.device_id_1, id.device_id_2, id.extended_device_id);
      // adesto_cs();

      // adesto_cs();
      adesto_write_enable();
      vTaskDelay(1);

      // flash_erase_chip();
      flash_erase_page(data_address);

      adesto_write_enable();
      vTaskDelay(1);

      uint8_t status;
      status = adesto_read_status();
      fprintf(stderr, "device status is: 0x%X \n", status);

      write_to_flash_8bitdata(data_address, input_data, write_times);
      // vTaskDelay(1);
      // ssp2__lab_exchange_byte(input_data);
      adesto_write_disable();
      vTaskDelay(1);
      fprintf(stderr, "data write start from location 0x%X is: 0x%X, for %d times\n", data_address, input_data,
              write_times);

      uint8_t status_0;
      status_0 = adesto_read_status();
      fprintf(stderr, "device status is: 0x%X \n", status_0);

      // start to read the flash
      // adesto_cs();
      uint8_t *result_arrary = adesto_read_arrary_address_input(data_address);
      // vTaskDelay(1);
      // adesto_ds();
      fprintf(stderr,
              "data read start from location 0x%X is: 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X\n",
              data_address, result_arrary[0], result_arrary[1], result_arrary[2], result_arrary[3], result_arrary[4],
              result_arrary[5], result_arrary[6], result_arrary[7], result_arrary[8], result_arrary[9]);
      fprintf(stderr, " \n");
      // fprintf(stderr, "data read from location is: %p\n", array_read);
      vTaskDelay(1000);
    }
  }
}

//}
#endif

/// lab 6 part 1
#if 1
void uart_read_task(void *p) {
  while (1) {
    // TODO: Use uart_lab__polled_get() function and printf the received value
    char data_read_from_poll = 'a';
    vTaskDelay(100);
    uint8_t as;
    uart_lab__polled_get(UART_3, &data_read_from_poll);
    fprintf(stderr, "data read from UART poll is: %c \n", data_read_from_poll);
    vTaskDelay(500);
  }
}

void uart_write_task(void *p) {
  while (1) {
    // TODO: Use uart_lab__polled_put() function and send a value
    char data_write_to_poll = '$';
    vTaskDelay(1000);
    uart_lab__polled_put(UART_3, data_write_to_poll);
    // vTaskDelay(500);
  }
}
#endif

/// lab 6 part 2
#if 0
void uart_interrupt_task(void *p) {
  const char data_get_from_uart_queue;
  while (1) {
    if (uart_lab__get_char_from_queue(&data_get_from_uart_queue, 500)) {
      fprintf(stderr, "data: %c\n", data_get_from_uart_queue);
    } else
      fprintf(stderr, "no data in the queue\n");
  }
}
#endif

/// lab 6 part 3
#if 0
xSemaphoreHandle uart_TR_handler;
// This task is done for you, but you should understand what this code is doing
void board_1_sender_task(void *p) {

  char number_as_string[16] = {0};

  while (true) {
    // if (xSemaphoreTake(uart_TR_handler, 99999)) {
    const int number = rand();
    sprintf(number_as_string, "%i", number);

    // Send one char at a time to the other board including terminating NULL char
    for (int i = 0; i <= strlen(number_as_string); i++) {
      uart_lab__polled_put(UART_3, number_as_string[i]);
      printf("Sent: %c\n", number_as_string[i]);
    }
    // vTaskDelay(1000);
    printf("Sent: %i over UART to the other board\n", number);
    vTaskDelay(3000);
    // xSemaphoreGive(uart_TR_handler);
    //}
  }
}

void board_2_receiver_task(void *p) {
  char number_as_string[16] = {0};
  int counter = 0;
  while (true) {
    // if (xSemaphoreTake(uart_TR_handler, 99999)) {
    char byte = 0;
    // vTaskDelay(50);
    uart_lab__get_char_from_queue(&byte, 9999);
    vTaskDelay(50);
    printf("Received: %c\n", byte);

    // This is the last char, so print the number
    if ('\0' == byte) {
      number_as_string[counter] = '\0';
      counter = 0;
      printf("Received this number from the other board: %s\n \n", number_as_string);
    }
    // We have not yet received the NULL '\0' char, so buffer the data
    else {
      number_as_string[counter] = byte;
      if (counter < 16) {
        counter++;
      } else {
        printf("reaching FIFO size limit \n");
      }
      // Hint: Use counter as an index, and increment it as long as we do not reach max value of 16
    }
    vTaskDelay(50);
    // xSemaphoreGive(uart_TR_handler);
    //}
  }
}
#endif

/// Producer Consumer Tasks
#if 1
static QueueHandle_t switch_queue;

typedef enum { switch__off, switch__on } switch_e;

switch_e get_switch_input_from_switch0(port_pin_s pin_num) {
  port_pin_s led0 = {2, 3};
  gpiox__set_as_input(pin_num);
  gpiox__set_as_output(led0);
  if (gpiox__get_level(pin_num)) {
    gpiox__set_low(led0);
    vTaskDelay(50);
    gpiox__set_high(led0);
    vTaskDelay(50);
    gpiox__set_low(led0);
    vTaskDelay(50);
    return switch__on;
  } else {
    return switch__off;
  }
}

// TODO: Create this task at PRIORITY_LOW
void producer(void *p) {
  static port_pin_s test_switch = {1, 19};
  while (1) {
    // This xQueueSend() will internally switch context to "consumer" task because it is higher priority than this
    // "producer" task Then, when the consumer task sleeps, we will resume out of xQueueSend()and go over to the next
    // line

    // TODO: Get some input value from your board
    const switch_e switch_value = get_switch_input_from_switch0(test_switch);

    // TODO: Print a message before xQueueSend()
    fprintf(stderr, "producer: before xqueuesend...\n");
    // Note: Use printf() and not fprintf(stderr, ...) because stderr is a polling printf
    xQueueSend(switch_queue, &switch_value, 0);
    // TODO: Print a message after xQueueSend()
    fprintf(stderr, "producer: after xqueuesend...\n");
    fprintf(stderr, "during 1 second delay-->\n");
    vTaskDelay(1000);
  }
}

