CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
// TODO: Create this task at PRIORITY_HIGH
void consumer(void *p) { //先运行
  switch_e switch_value;
  while (1) {
    // TODO: Print a message before xQueueReceive()
    // vTaskDelay(50);
    fprintf(stderr, "consumer: before xqueuerecieve...\n");
    xQueueReceive(switch_queue, &switch_value, portMAX_DELAY);
    // this task will sleep for up to portMAX_DELAY until there is an item in the queue
    // vTaskDelay(50);
    // TODO: Print a message after xQueueReceive()
    fprintf(stderr, "consumer: switch value get from queue is: %d\n \n", switch_value);
  }
}
#endif

/// lab 7 CLI task
#if 1
void cli_led(void *p) {
  const port_pin_s *led_num = (port_pin_s *)(p);
  gpiox__set_as_output(*led_num);
  while (1) {
    gpiox__set_low(*led_num);
    vTaskDelay(200);
    gpiox__set_high(*led_num);
    vTaskDelay(200);
  }
}
#endif

int main(void) {
/// lab 2 part 0, 1
#if 0
  xTaskCreate(lab2_led_task, "LED", 1024 / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 2 part 2
#if 0
  // This is static such that these variables will be allocated in RAM and not go out of scope
  static port_pin_s led0 = {2, 3};
  static port_pin_s led1 = {1, 26};
  xTaskCreate(lab2_led_task0, "LED0", 1024 / sizeof(void *), &led0, 1, NULL); // &led0 is a task parameter going to
  // vTaskDelay(1500);
  xTaskCreate(lab2_led_task1, "LED1", 1024 / sizeof(void *), &led1, 1, NULL);
  // vTaskDelay(1500);
  vTaskStartScheduler();
  // return 0;
#endif

/// lab 2 part 3
#if 0
  switch_press_indication = xSemaphoreCreateBinary();
  static port_pin_s test_switch = {0, 30}; // SW
  static port_pin_s test_led = {1, 24};    // LED
  // printf("level: %d", gpiox__get_level(test_switch)) 
  xTaskCreate(switch_task, "test_switch", 1024 / sizeof(void *), &test_switch, 1, NULL);
  // xTaskCreate(switch_task, "test_switch", configMINIMAL_STACK_SIZE, (void *)&test_switch, 1, NULL);
  xTaskCreate(lab2_led_task, "test_led", 1024 / sizeof(void *), &test_led, 1, NULL);
  // xTaskCreate(lab2_led_task, "test_led", , (void *)&test_led, 1, NULL);
  vTaskStartScheduler();configMINIMAL_STACK_SIZE
  return 0;
#endif

/// lab 3 part 0
#if 0
  /// Read Table 95 in the LPC user manual and setup an interrupt on a switch connected to Port0 or Port2
  /// a) For example, choose SW2 (P0_30) pin on SJ2 board and configure as input
  ///Warning: P0.30, and P0.31 require pull-down resistors
  static port_pin_s test_switch = {0, 29}; // SW
  static port_pin_s test_led = {1, 24};    // LED
  gpiox__set_as_input(test_switch);
  // b) Configure the registers to trigger Port0 interrupt (such as falling edge)
  gpiox__trigger_level(test_switch, 0); // set as triggering at the falling edge
  // Install GPIO interrupt function at the CPU interrupt (exception) vector
  // c) Hijack the interrupt vector at interrupt_vector_table.c and have it call our gpio_interrupt()
  //    Hint: You can declare 'void gpio_interrupt(void)' at interrupt_vector_table.c such that it can see this function
  // Most important step: Enable the GPIO interrupt exception using the ARM Cortex M API (this is from lpc40 qxx.h)
  NVIC_EnableIRQ(GPIO_IRQn);
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpio_interrupt); // gpio_interrupt = ISR
  // Toggle an LED in a loop to ensure/test that the interrupt is entering ane exiting
  // For example, if the GPIO interrupt gets stuck, this LED will stop blinking
  // vTaskStartScheduler();
  while (1) {
    delay__ms(100);
    // T/ODO: Toggle an LED here
    gpiox__set_high(test_led);
    delay__ms(500);
    gpiox__set_low(test_led);
    delay__ms(500);
  }
  // vTaskStartScheduler();
  // return 0;
#endif

/// lab 3 part 1
#if 0
  switch_pressed_signal = xSemaphoreCreateBinary(); // Create your binary semaphore
  static port_pin_s test_switch2 = {0, 30};
  static port_pin_s test_led2 = {1, 24};
  gpiox__set_as_input(test_switch2);
  gpiox__trigger_level(test_switch2, 0);
  // configure_your_gpio_interrupt(); // T/ODO: Setup interrupt by re-using code from Part 0
  NVIC_EnableIRQ(GPIO_IRQn); // Enable interrupt gate for the GPIO
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpio_interrupt2);
  xTaskCreate(sleep_on_sem_task, "sleep_sem", (512U * 4) / sizeof(void *), &test_led2, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 3 part 2
#if 1
  /* SW0: P1_19; LED0: P2_3;
   * SW1: P1_15; LED1: P1_26;
   * SW2: P0_30; LED2: P1_24;
   * SW3: P0_29; LED3: P1_18;
   */
  switch_pressed_signal_hw3_part2_30 = xSemaphoreCreateBinary();
  switch_pressed_signal_hw3_part2_31 = xSemaphoreCreateBinary();
  static port_pin_s part2_test_switch_2 = {0, 30};
  gpiox__set_as_input(part2_test_switch_2);
  static port_pin_s part2_test_switch_3 = {0, 29};
  gpiox__set_as_input(part2_test_switch_3);

  static port_pin_s test_led_main = {2, 3};
  gpiox__set_as_output(test_led_main);

  static port_pin_s part2_test_led_0 = {1, 26};
  static port_pin_s part2_test_led_1 = {1, 24};

  fprintf(stderr, "Entering...\n");
  gpiox__attach_interrupt(part2_test_switch_2, GPIO_INTR__RISING_EDGE, gpio_interrupt_part2_0);
  gpiox__attach_interrupt(part2_test_switch_3, GPIO_INTR__FALLING_EDGE, gpio_interrupt_part2_1);

  NVIC_EnableIRQ(GPIO_IRQn);
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpiox__interrupt_dispatcher, "unused");

  xTaskCreate(pin30_isr, "Interrupt 1", (512U * 4) / sizeof(void *), &part2_test_led_0, 2, NULL);
  xTaskCreate(pin31_isr, "Interrupt 2", (512U * 4) / sizeof(void *), &part2_test_led_1, 2, NULL);
  xTaskCreate(main_func, "main function", (512U * 4) / sizeof(void *), &test_led_main, 1, NULL);
  vTaskStartScheduler();
  return 0;
#endif

/// lab 4 part 0
#if 0
  xTaskCreate(pwm_task, "pwm_led", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 4 part 1
#if 0
  xTaskCreate(adc_task, "adc_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 4 part 2
#if 0
  // Queue will only hold 1 integer
  adc_to_pwm_task_queue = xQueueCreate(1, sizeof(int)); // important to do this initailize step

