CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
  xTaskCreate(adc_task, "adc_task_sending_to_pwm", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(pwm_task, "pwm_led", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 5 part 0
#if 0
// function writen in SSP2.C and SSP2.h
#endif

/// lab 5 part 1
#if 0
  xTaskCreate(spi_task, "spi_id_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 5 part 2
#if 0
  // TODO: Initialize your SPI, its pins, Adesto flash CS GPIO etc...
  spi_id_mutex_handler = xSemaphoreCreateMutex();
  const uint32_t spi_clock_mhz_part2 = 24;
  ssp2__lab_init(spi_clock_mhz_part2);
  // Create two tasks that will continously read signature
  xTaskCreate(spi_id_verification_task, "spi_id_guard1", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(spi_id_verification_task_2, "spi_id_guard2", (512U * 4) / sizeof(void *), NULL, 1, NULL);

  vTaskStartScheduler();

#endif

/// lab 5 part 3 (extra credit)
#if 0
  xTaskCreate(spi_flash_read_page, "spi_id_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 6 part 1
#if 0
  // TODO: Use uart_lab__init() function and initialize UART2 or UART3 (your choice)
  // TODO: Pin Configure IO pins to perform UART2/UART3 function
  // fprintf(stderr, "core clk:%ld  per_clk: %ld\n", clock__get_core_clock_hz(), clock__get_peripheral_clock_hz());
  const uint32_t peripheral_clock = clock__get_peripheral_clock_hz();
  uart_lab__init(UART_2, peripheral_clock, 9600);
  uart_lab__init(UART_3, peripheral_clock, 9600);
  fprintf(stderr, "core clk:%ld  peripheral clk: %ld\n", clock__get_core_clock_hz(), clock__get_peripheral_clock_hz()); 

  // gpio__construct_with_function(GPIO__PORT_0, 10, GPIO__FUNCTION_1); // U2_TXD this one not works
  gpio__construct_with_function(GPIO__PORT_0, 11, GPIO__FUNCTION_1); // U2_RXD
  gpio__construct_with_function(GPIO__PORT_2, 8, GPIO__FUNCTION_2);  // u2_txd
  gpio__construct_with_function(GPIO__PORT_2, 9, GPIO__FUNCTION_2);  // u2_rxd

  gpio__construct_with_function(GPIO__PORT_0, 0, GPIO__FUNCTION_2);  // U3_TXD
  gpio__construct_with_function(GPIO__PORT_0, 1, GPIO__FUNCTION_2);  // U3_RXD
  gpio__construct_with_function(GPIO__PORT_0, 25, GPIO__FUNCTION_3); // u3_txd
  gpio__construct_with_function(GPIO__PORT_0, 26, GPIO__FUNCTION_3); // u3_rxd

  xTaskCreate(uart_read_task, "uart_read", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(uart_write_task, "uart_write", (512U * 4) / sizeof(void *), NULL, 1, NULL);

  vTaskStartScheduler();
#endif

/// lab 6 part 2 & 3
#if 0
  // fprintf(stderr, "core clk:%ld  per_clk: %ld\n", clock__get_core_clock_hz(), clock__get_peripheral_clock_hz());
  //uart_TR_handler = xSemaphoreCreateMutex();
  const uint32_t peripheral_clock = clock__get_peripheral_clock_hz();
  uart_lab__init(UART_2, peripheral_clock, 9600);
  uart_lab__init(UART_3, peripheral_clock, 9600);
  fprintf(stderr, "core clk:%ld  peripheral clk: %ld\n", clock__get_core_clock_hz(), clock__get_peripheral_clock_hz());

  // gpio__construct_with_function(GPIO__PORT_0, 10, GPIO__FUNCTION_1); // U2_TXD this one not works
  gpio__construct_with_function(GPIO__PORT_0, 11, GPIO__FUNCTION_1); // U2_RXD
  gpio__construct_with_function(GPIO__PORT_2, 8, GPIO__FUNCTION_2);  // u2_txd
  gpio__construct_with_function(GPIO__PORT_2, 9, GPIO__FUNCTION_2);  // u2_rxd

  gpio__construct_with_function(GPIO__PORT_0, 0, GPIO__FUNCTION_2);  // U3_TXD
  gpio__construct_with_function(GPIO__PORT_0, 1, GPIO__FUNCTION_2);  // U3_RXD
  gpio__construct_with_function(GPIO__PORT_0, 25, GPIO__FUNCTION_3); // u3_txd
  gpio__construct_with_function(GPIO__PORT_0, 26, GPIO__FUNCTION_3); // u3_rxd

  uart__enable_receive_interrupt(UART_2);
  uart__enable_receive_interrupt(UART_3);

  // xTaskCreate(uart_interrupt_task, "uart_read_interrupt", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  // xTaskCreate(uart_write_task, "uart_write", (512U * 4) / sizeof(void *), NULL, 1, NULL);

  xTaskCreate(board_1_sender_task, "uart_send", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(board_2_receiver_task, "uart_recive", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  sj2_cli__init();
  vTaskStartScheduler();
#endif

/// Producer Consumer Tasks
#if 0
  // sj2_cli__init();
  // TODO: Create your tasks
  xTaskCreate(producer, "producer", (512U * 4) / sizeof(void *), NULL, PRIORITY_HIGH, NULL);
  xTaskCreate(consumer, "consumer", (512U * 4) / sizeof(void *), NULL, PRIORITY_LOW, NULL);
  // TODO Queue handle is not valid until you create it
  switch_queue =
      xQueueCreate(3, sizeof(switch_e)); // Choose depth of item being our enum (1 should be okay for this example)

  vTaskStartScheduler();
#endif

/// lab 7 CLI task
#if 0
  sj2_cli__init();
  static port_pin_s cli_task_led = {2, 3};
  xTaskCreate(cli_led, "cli_led", (512U * 4) / sizeof(void *), &cli_task_led, 1, NULL);
  // vTaskResetRunTimeStats();
  vTaskStartScheduler();
#endif
}

// P3_15

// LPC_IOCON->P3_15 &= ~(7 << 0); ~0111 = 1000
// LPC_GPIO3->SET |= ( 1 << 15);
// LPC_GPIO3->CLR |= ( 1 << 15);

// LPC_SC->PCONP |= ( 1 << 24 );
// PCONP里面有32个bit，每一个bit控制了一个peripheral的电源

// ==, =, |=, &=,

// LPC_UART2->LRC = ( 1 << 7 ); 1 << 7 = 0000 0000 0000 0000 0000 0000 10000000
// LPC_UART2->LRC = 0000 0000 0000 0000 0000 0000 10000000

// LPC_UART2->LRC &= ~( 1 << 7 ); ~(1 << 7) = 1111 1111 1111 1111 1111 1111 01111111
// LPC_UART2->LRC &= 1111 1111 1111 1111 1111 1111 01111111

// LPC_UART2->LRC ^= (1 << 5); (1 << 5) = 10000
// LPC_UART2->LRC = (LPC_UART2->LRC) xor (10000)

// $s1 write only
// addi $t0, 5 (0101)
// orr $s1, $s1, $t0

// addi THR, output_byte

// LPC_SSP0->SR
// 96 0000 0000 hz = cpu clock
// 9600 = baud

// const uint16_t divider_16_bit = (96 0000 0000 / (16 * 9600));
